<template>
	<div id="details">
		<!--公告详情的内容部分-->
		<div class="details_content">
			<div class="details_title" :class="{'notice_title_white':getColor == 1}">
				<p>{{$t("public.TermsOfUser")}}</p>
			</div>
			<!--用户协议内容-->
			<div class="uaerContent" :class="{'uaerContent_wrapper':getColor == 1}">
				请您在注册成为本网站用户前务必仔细阅读本用户使用条款（以下称“本协议”），若您不同意或无法理解本协议的任意内容，请勿访问本网站或使用本网站服务。若您注册成为本网站用户，则表示：（1）您已经签订本协议；（2）您对本协议的全部内容已充分阅读并认可和同意遵守；（3）您承诺遵守任何可适用的法律、法规、规章及其他政府规范性文件的规定，如有违反而造成任何法律后果，您将以独立承担所有相应的法律责任。 本协议适用由imex technology PTE. LTD.（以下称“公司”）提供的所有服务，包括但不限于通过公司运营网站www.imex.com（以下称“网站”）及后续由公司发布的移动应用程序向您提供的数字资产交易和相关服务（以下称“服务”）。 本协议由公司与用户共同签订，公司是一家根据新加坡共和国相关法律在新加坡共和国注册成立的公司。为了本协议表述之方便，公司和网站在本协议中合称为“我们”。于本网站进行用户注册的适格自然人或其他主体均为本网站的用户，统称为“您”。我们和您在本协议中合称为“双方”，我们或您单称为“一方”。 风险揭示及提醒： 数字资产交易有极高风险，并不适合绝大部分人士。您了解和理解此投资有可能导致部分损失或全部损失，所以您应该以能承受的损失程度来决定投资的金额。您了解和理解数字资产会产生衍生风险，所以如有任何疑问，建议先寻求理财顾问或其他专业人士的协助。此外，除了下述提及过的风险以外，还会有未能预测的风险存在。您应慎重考虑并用清晰的判断能力去评估自己的财政状况及上述各项风险而作出任何买卖数字资产的决定，并承担由此产生的全部损失，我们对此不承担任何责任。 1.信息准确风险：除IMX以外，本网站所载的数字资产均不由本公司或本网站发行，本公司或本网站不对本网站所载的数字资产的及或其信息的真实、准确、合法性负责。 2.市场风险：数字资产市场是一个新兴且未经确认的市场，而且数字资产随时可能失去价值，数字市场也可能消失。 3.交易风险：数字货币因全天不间断交易，没有涨跌限制，价格容易受全球政府政策等诸多因素的影响而大幅波动，在完成交易过程中也存在操作错误可能无法追回情况。 4.政策法律风险：因各国对数字资产的法律地位未确定，意味持有数字资产的合法性不明确。且数字资产是否被认定为资产也因不同国家法规而不一致。且可能因各国法律、法规和规范性文件的制定或者修改，数字资产交易随时可能被暂停或被禁止。 5.软件系统风险：使用互联网形式的交易系统存有风险，包括但不限于软件、硬件和互联网链结的失败等或被黑客攻击的可能。由于我们不能控制互联网的可靠性和可用性，也无法控制黑客攻击行为。 1总则 1.1本协议由正文、本网站已经发布的隐私条款及本网站已经发布的或将来可能发布的各类规则、声明、说明等构成。 1.2您成为本网站的用户前，请务必仔细阅读本协议，若您不同意或无法理解本协议的任意内容，请勿访问本网站或使用本网站服务。 1.3您成为本网站的用户后，您将获得一个帐号及相应的密码，该帐号和密码由您负责保管；您应当对以其您帐号进行的所有活动和事件负法律责任。我们也将严格采取相应技术措施保护用户的账号及个人信息安全，包括但不限于对用户密码相关信息采用专业加密的存储与传输方式。同时，我们将运用相关安全技术确保我们掌握的信息不丢失、不被滥用和变造。但请注意，尽管公司将竭尽全力保护您的账号及信息安全，但在互联网情况下不存在绝对安全的保障措施。 1.4本网站仅作为您获取数字资产信息、寻找交易方、就数字资产的交易进行协商及开展交易的场所，本网站不参与您的任何交易。故您应自行谨慎判断确定相关数字资产及/或信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。本网站的任何意见、消息、探讨、分析、价格、建议和其他资讯均是一般的市场评论，并不构成投资建议。我们不承担任何因依赖该资讯直接或间接而产生的损失。 1.5本网站的内容会随时更改并不作另行通知，您应当及时关注本网站的更新。我们已采取合理措施确保网站资讯的准确性，但并不能保证其准确性程度，亦不会承担任何因本网站上的资讯或因未能链结互联网、传送或接收任何通知和信息时的延误或失败而直接或间接产生的损失。 1.6禁止使用本网站从事洗钱、走私、商业贿赂等一切非法交易活动，若发现此类事件，本站将采取各种可使用之手段，包括但不限于冻结账户，通知相关权力机关等，我们不承担由此产生的所有责任并保留向相关人士追究责任的权利。 2适用范围 2.1本服务仅适用于18岁或以上的用户或其他适格主体。 2.2如您属于自然人，请您确认您已年满18周岁或根据不同的可适用的法律规定的具有可订立合同的法定年龄，并有充分的能力接受这些条款，并使用本网站进行数字资产交易。 2.3如您如果您代表任何实体使用本服务，您声明并保证（1）该实体是符合注册地法律法规的合法机构；（2）您有权代表该实体接受本协议。如果您违反本协议，该实体同意对您的行为负责。 2.4请确认您不属于下列国家或地区的用户：美国、中国大陆、中国香港、古巴、伊朗、朝鲜、克里米亚、苏丹、马来西亚、叙利亚、孟加拉国、玻利维亚、厄瓜多尔和吉尔吉斯斯坦或根据任何可能适用的法律导致IMX所提供的服务受限制的任何其他管辖区的居民。如果您不符合这些要求，请勿使用我们的服务，我们也将保留立即停止您使用IMX所有服务的权利。 3协议修订 3.1公司保留不时修订本协议条款的权利，包括但不限于本协议具体条款及本网站的任何政策、准则等其他相关内容。在修订本协议后，我们会将修订后的条款通过以网站公示的方式进行公告，无特殊情况，公司不再单独通过电子邮件方式发送至您注册的邮件。变更后的协议会在本协议首页标注“最后修订”的日期，一经在网站公布，立即生效。您应不时浏览及关注本协议的更新变更日期及更新内容，如您不同意相关变更，应当立即停止使用本网站服务；您继续使用本网站服务，即表示您接受并同意经修订的协议的约束。如在使用本网站中存在任何问题，请及时联系law@imx.com. 4注册流程 4.1为使用我们的服务，您同意根据本网站用户注册页面的要求提供有效的注册信息，包括但不限于您的姓名、电子邮箱、手机号码等信息在您进行注册时，您必须同意并接受本协议。 4.2您确保您已经合法、真实、完整并有效提供注册所需信息并经验证，在您完成注册之后，您有权获得本网站账号和密码，您获得本网站账号及密码时视为注册成功，可在本网站进行会员登陆。并对以此账号和密码登入系统后所发生的所有活动和事件负责，自行承担一切使用该账号的言语、行为等而直接或者间接导致的法律责任。 4.3您有责任保留，保护和保障任何已经获得的账号、密码。如遗失的，可以通过注册电子邮箱发送的链接重置密码或可凭借手机号码找回原密码。用户若发现任何非法使用用户名或存在其他安全漏洞的情况，应立即告知本网站。 4.4本网站有权在合理时间内对您的该等请求采取行动，但本网站对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。您在未经本网站同意的情况下不得将本网站账号以赠与、借用、租用、转让或其他方式处分给他人。 4.5如按照不同国家、地区相关法律法规的规定，您必须根据我们的要求及时提供您的真实姓名、身份证件等法律法规，包括反洗钱规定的相关信息。您应对该等信息的真实性、完整性和准确性负责，并承担因提供虚假或不完整信息产生的任何直接或间接损失及不利后果。 5我们的服务 5.1本网站只为您通过本网站进行数字资产交易活动提供服务，包括但不限于提供【币币交易、合约或其他衍生品、数字资产资讯】等网络交易平台服务。本网站保持对已提供的服务进行调整的权利。本网站不接受也不提供任何国家法定货币充入和提取的相关服务。 5.2其他本网站为您提供的服务。 6您的权利和义务 6.1您有权在本网站浏览数字资产资讯，包括各项产品的实时行情及交易信息，并通过本网站提交数字资产交易指令并完成数字资产交易。 6.2您有权在本网站查看您注册账号下的信息，有权通过本网站提供的功能进行操作。 6.3您有权按照本网站发布的活动规则参与本网站组织的网站活动。 6.4您保证交易中涉及到的属于您的数字资产均为合法取得并所有。 6.5您同意您为您自身的交易或非交易行为承担全部责任和任何收益或亏损。 6.6您确认注册时提供的信息是真实和准确的。 6.7您同意遵守任何有关法律的规定，就税务目的而言，包括报告任何交易利润。 6.8您应当遵守法律法规、规章、及政策要求的规定，不得在本网站或利用本网站服务从事非法或其他损害本网站或第三方权益的活动。 6.9您同意您对您的本网站的账号、密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。 6.10您在本网站进行数字资产交易时不得恶意干扰数字资产交易的正常进行、破坏交易秩序；不得以任何技术手段或其他方式干扰本网站的正常运行或干扰其他用户对本网站服务的使用；不得以虚构事实等方式恶意诋毁本网站的商誉。 6.11如您因网上交易与其他用户产生纠纷的，不得通过司法或行政以外的途径要求本网站提供相关资料。 6.12您在使用本网站提供的服务过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。 6.13您应当遵守本网站不时发布和更新的本协议以及其他服务条款和操作规则，有权随时终止使用本网站提供的服务。 7我们的权利和义务 7.1如您不具备本协议约定的注册资格，则本网站有权拒绝您进行注册，对已注册的，本网站有权注销您的账号，本网站保留向您或您的有权代理人追究责任的权利。同时，本网站保留其他任何情况下决定是否接受您注册的权利。 7.2本网站发现账户使用者并非账户初始注册人时，有权中止或终止该账户的使用。 7.3本网站通过技术检测、人工抽检等检测方式合理怀疑您提供的信息错误、不实、失效或不完整时，有权通知您更正、更新信息或中止、终止为其提供本网站服务。 7.4本网站有权在发现本网站上显示的任何信息存在明显错误时，对信息予以更正。 7.5本网站保留随时修改、中止或终止本网站服务的权利，本网站行使修改或中止服务的权利不需事先告知您；本网站终止本网站一项或多项服务的，终止自本网站在网站上发布终止公告之日生效。 7.6本网站应当采取必要的技术手段和管理措施保障本网站的正常运行，并提供必要、可靠的交易环境和交易服务，维护数字资产交易秩序。 7.7本网站通过加强技术投入、提升安全防范等措施保障您的数字资产的安全，有义务在您账户出现可以预见的安全风险时提前通知您。 7.8本网站有权随时删除本网站内各类不符合法律法规或本网站规定等的内容信息，本网站行使该等权利不需提前通知您。 7.9本网站有权根据您所属主权国家或地区的法律法规、规则、命令等规范的要求，向您要求提供更多的信息或资料等，并采取合理的措施以符合当地的规范之要求，您有义务配合上述措施；本网站有权根据您所属主权国家或地区的法律法规、规则、命令等规范的要求，暂停或永久停止对您的开放本网站及其部分或全部服务。 8赔偿 8.1因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反了法律、法规、规章、政府规范性文件或侵害了第三方的权利，而使本公司及其股东、职员、代理人在第三方对本网站及其股东、职员、代理人提起的诉讼中遭受的任何损失（包括但不限于由此产生的司法费用和聘请其他专业人士的费用），您必须对本公司及股东、职员、代理人承担赔偿责任，使其等免遭损失。 8.2如因本网站违反有关法律、法规或本协议项下的任何条款而给用户造成损失，本网站同意承担由此造成的损害赔偿责任。 9责任限制与免责 9.1您了解并同意，在任何情况下，我们不就以下各事项承担责任： 9.1.1收入的损失； 9.1.2交易利润或合同损失； 9.1.3业务中断 9.1.4预期可节省的货币的损失； 9.1.5信息的损失； 9.1.6机会、商誉或声誉的损失； 9.1.7购买替代产品或服务的成本； 9.1.8任何由于侵权（包括过失）、违约或其他任何原因产生的间接的、特殊的或附带性的损失或损害，不论这种损失或损害是否可以为我们合理预见；不论我们是否事先被告知存在此种损失或损害的可能性。 9.2您了解并同意，我们不对因下述任一情况而导致您的任何损害赔偿承担责任： 9.2.1我们有合理的理由认为您的具体交易事项可能存在重大违法或违约情形时对您采取本协议下相关措施。 9.2.2我们有合理的理由认为您在本网站的行为涉嫌违法或不当时对您采取本协议下相关措施。 9.2.3您通过本网站服务购买或获取任何数据、信息或进行交易等行为或替代行为产生的费用及损失。 9.2.4您对本网站服务的误解。 9.2.5任何非因我们的原因而引起的与本网站提供的服务有关的其它损失。 9.3我们对由于信息网络设备维护、信息网络连接故障、电脑、通讯或其他系统的故障、电力故障、天气原因、意外事故、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、银行或其他合作方原因、数字资产市场崩溃、政府行为、司法或行政机关的命令、其他不在我们可控范围内或我们无能力控制的行为或第三方的原因而造成的不能服务或延迟服务，以及造成的您的损失，我们不承担任何责任。 9.4我们不能保证本网站包含的全部信息、程序、文本等完全安全，不受任何病毒、木马等恶意程序的干扰和破坏，故您登陆、使用本网站任何服务或下载及使用该下载的任何程序、信息、数据等均是您个人的决定并自行承担风险及可能产生的损失。 9.5我们对本网站中链接的任何第三方网站的任何信息、产品及业务及其他任何形式的不属于我们的主体的内容等不做任何保证和承诺，您如果使用第三方网站提供的任何服务、信息及产品等均为您个人决定且承担由此产生的一切责任。 9.6我们对于您使用本网站服务不做任何明示或暗示的保证，包括但不限于本网站提供服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，我们也不对本网站提供的服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。是否登陆或使用本网站提供的服务是您个人的决定且自行承担风险及可能产生的损失。我们对于数字资产的市场、价值及价格等不做任何明示或暗示的保证，您理解并了解数字资产市场是不稳定的，价格和价值随时会大幅波动或崩盘，交易数字资产是您个人的自由选择及决定且自行承担风险及可能产生的损失。 9.7本协议中规定的我们的保证和承诺是由我们就本协议和本网站提供的服务的唯一保证和陈述，并取代任何其他途径和方式产生的保证和承诺，无论是书面的或口头的，​​明示的或暗示的。所有这些保证和陈述仅仅代表我们自身的承诺和保证，并不保证任何第三方遵守本协议中的保证和承诺。 9.8我们并不放弃本协议中未提及的在法律适用的最大范围内我们享有的限制、免除或抵销我们损害赔偿责任的任何权利。 9.9您注册后即表示认可我们按照本协议中规定的规则进行的任何操作，产生的任何风险均由您承担。 10协议的终止 10.1本网站有权依据本协议约定注销您的本网站账号，本协议于账号注销之日终止。 10.2本网站有权依据本协议约定终止全部本网站服务，本协议于本网站全部服务终止之日终止。 10.3本协议终止后，您无权要求本网站继续向您提供任何服务或履行任何其他义务。 10.4本协议的终止不影响守约方向违约方要求其他责任的承担。 11知识产权 11.1本网站所包含的全部智力成果包括但不限于网站标志、数据库、网站设计、文字和图表、软件、照片、录像、音乐、声音及其前述组合，软件编译、相关源代码和软件(包括小应用程序和脚本) 的知识产权权利均归本网站所有。您不得为商业目的复制、更改、拷贝、发送或使用前述任何材料或内容。 11.2本网站名称中包含的所有权利 (包括但不限于商誉和商标、标志)均归公司所有。 11.3您在使用本网站服务过程中不得非法使用或处分本网站或他人的知识产权权利。 11.4您登陆本网站或使用本网站提供的任何服务均不视为我们向您转让任何知识产权。 12信息保护 12.1我们将在本网站公布隐私条款并根据合理情况对其进行修订，隐私条款构成本协议的有效组成部分。 13转让 13.1您不得在未取得我们书面同意的前提下转让给任何第三人，但我们可在给予您提前30天的通知的前提下，将我们在本协议中的权利和义务转让给任何第三人。 14可分割性 14.1如本协议中的任何条款被任何有管辖权的法院认定为不可执行、无效或非法时，并不影响本协议的其余条款的效力。 15非代理关系 15.1本协议中的任何规定均不可被认为创造了、暗示了或以其他方式将我们视为您的代理人、受托人或其他代表人，本协议有其他规定的除外。 16弃权 16.1任何一方对追究本协议约定的违约责任或其他责任的弃权并不能认定或解释为对其他违约责任的弃权；任何情况下，未行使任何权利或救济不得被解释为对该等权利或救济的放弃。 17标题 17.1所有标题仅供协议表述方便，并不用于扩大或限制该协议条款的内容或范围。 18适用法律 18.1本协议的订立、变更、执行和解释，以及与本协议有关的争议解决，均应适用新加坡法律。如与本协议有关的某一特定事项没有法律规定或规定不明确，则应参照通用的国际商业惯例和行业惯例。 18.2如因本协议或本网站服务所引起或与其有关的任何争议应提交新加坡国际仲裁中心（下称“新仲”），依据仲裁开始时最新施行的《新加坡国际仲裁中心仲裁规则》（下称“新仲规则”），以新加坡为仲裁地，通过仲裁方式最终解决。新仲规则视为本仲裁条款的一部分。 19协议的生效和解释 19.1本协议于您点击本网站注册页面的同意注册并完成注册程序、获得本网站账号和密码时生效，对本网站和您均具有约束力。 19.2本协议的最终解释权归本网站所有。
			</div>

		</div>

	</div>
</template>

<script>
	import axios from "axios";
	import { httpUrl } from "../http_url/http_url";
	import $ from "jquery";
	export default {
		data() {
			return {

			}
		}
	}
</script>

<style lang="scss">
	/*白色版本开始*/

	.notice_title_white {
		border-bottom: 2px solid #312e67 !important;
		p {
			background: #312e67 !important;
		}
	}

	.uaerContent_wrapper {
		background: #fff !important;
		border: 2px solid #eee !important;
		color: #666 !important;
		p {
			color: #333 !important;
		}
	}
	/*白色版本结束*/
	/*用户协议主要内容部分*/

	.uaerContent {
		width: 100%;
		border: 2px solid #515774;
		margin-top: 40px;
		line-height: 30px;
		box-sizing: border-box;
		padding: 0 20px;
		/*公司简介*/
		.gs-jj {
			width: 100%;
			line-height: 30px;
			font-size: 15px;
			text-indent: 2em;
			margin-top: 20px;
		}
		/*重要提示*/
		.important {
			font-size: 16px;
			line-height: 40px;
		}
		/*提示内容*/
		.ti_shi {
			width: 100%;
			font-size: 13px;
			p {
				font-size: 16px;
				margin: 40px 0 10px 0;
			}
		}
	}

	#details {
		color: #fff;
	}
	/*公告详情头部*/

	.details_content {
		width: 70%;
		margin: 20px auto;
	}
	/*内容头部*/

	.details_title {
		width: 100%;
		height: 45px;
		width: 100%;
		border-bottom: 2px solid #515774;
		border-left: 2px solid #515774;
		p {
			width: 150px;
			height: 45px;
			text-align: center;
			font-size: 16px;
			line-height: 45px;
			color: #fff;
			background: #383962;
		}
	}
</style>
