<template>
	<div id="details">
		<!--公告详情的内容部分-->
		<div class="details_content">
			<div class="details_title" :class="{'notice_title_white':getColor == 1}">
				<p>{{$t("public.IMXprivacy")}}</p>
			</div>
			<!--用户协议内容-->
			<div class="uaerContent" :class="{'uaerContent_wrapper':getColor == 1}">
				本条款仅适用于IMX TECHNOLOGY PTE. LTD.（以下简称“IMX”），一家根据新加坡共和国相关法律在新加坡注册成立的公司的产品或服务，包括以下内容 最近更新日期：2018年6月1日 如果您有任何疑问、意见或建议，请通过以下联系方式与我们联系： 电子邮件：law@imx.com 本条款将帮助您了解以下内容： 1.我们如何收集和使用您的个人信息 2.我们如何使用Cookie和同类技术 3.我们如何共享、转让、公开披露您的个人信息 4.我们如何保护您的个人信息 5.您的权利 6.您的个人信息如何在全球范围转移 7.本条款如何更新 8.如何联系我们 IMX深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，保护您的个人信息，将按照合法、正当、必要的原则使用、收集及处理您的个人信息。同时，IMX承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。此外，我们已采取措施，防止洗钱、资助恐怖主义、规避贸易和经济制裁的行为。 请在使用我们的产品（或服务）前，仔细阅读并了解《隐私条款》。 一、我们如何收集和使用您的个人信息 个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。 IMX仅会出于本条款所述的以下目的，收集和使用您的个人信息： (一)为您提供以下服务 1、业务功能一：注册 为完成注册服务，您需提供以下信息：国籍/手机号/手机验证码/邮箱/密码/邀请码。 在注册过程中,如果您提供以下额外信息,将有助于我们给您提供好的服务和体验：工作职位、公司、教育背景。但如果您不提供这些信息，将不会影响使用本服务的基本功能。 您提供的上述信息，将在您使用本服务期间持续授权我们使用。在注销账号时，我们将停止使用并删除上述信息。 上述信息将存储新加坡共和国境内。如能跨境传输,我们将会单独征得您的授权同意。 业务功能二：【提现】 为完成【提现】服务，您需提供以下信息：【姓名/身份证号码】。 业务功能三：【点对点交易】 为完成【点对点交易】服务，您需提供以下信息：【身份证正反照片/人脸识别/验证视频】。 2、业务功能二：提现 为完成提现服务，您需提供以下信息：姓名/身份证号码/护照号码。 3、业务功能三：点对点交易 为完成点对点交易服务，您需提供以下信息：身份证正反照片/人脸识别/验证视频 当我们要将信息用于本条款未载明的其它用途时，会事先征求您的同意。 当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。 二、我们如何使用Cookie和同类技术 （一）Cookie 为确保网站正常运转，我们会在您的计算机或移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站能够存储您的偏好等数据。 我们不会将Cookie用于本条款所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。您可以清楚计算机保存的所有Cookie，但如果您这么做，则可能出现不便启动或使用我们网站的某些功能的情况。 三、我们如何共享、转让、公开披露您的个人信息 （一）共享 我们不会与IMX以外的任何公司、组织和个人分享您的个人信息, 以下情况除外： 1、在获取明确同意的情况下共享：获得您的明确同意后,我们会与其他方共享您的个人信息。 2、我们可能会根据法律法规规定,或按政府主管部门的强制性要求，对外共享您的个人信息。 3、与我们的关联公司共享：您的个人信息可能会与IMX的关联公司共享。我们只会共享必要的个人信息，且受本隐私条款中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。 4、与授权合作伙伴共享：仅为实现本条款中声明的目的,我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息,以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。 目前，我们的授权合作伙伴包括以下类型： 合作伙伴。除非得到您的许可,否则我们不会将您的个人身份信息（指可以识别您身份的信息，例如姓名或电子邮箱，通过这些信息可以联系到您或识别您的身份）与提供【*】服务的合作伙伴分享。我们会向这些合作伙伴提供有关【*】和【*】的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总以便它不会识别您个人。 (二)转让 我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外： 1.在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息； 2.在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私条款的约束，否则我们将要求该公司、组织重新向您征求授权同意。 (三)公开披露 我们仅会在以下情况，公开披露您的个人信息： 1.获得您的明确同意后； 2.基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。 四、我们如何保护您的个人信息 (一)我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据受SSL加密保护；我们同时对IMX网站提供https安全浏览方式；我们会使用加密技术确保数据的保密性：我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息：以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。【M&T Comments：请贵司详细说明对个人信息采取的保护性措施，可根据自身情况决定是否适用上述情况，并进行相应补充或调整】 (二)我们已经取得了以下认证：【*】。【M&T Comments：如有请贵司补充已经取得的相关认证。如无可相应删除。】 (三)我们的数据安全能力：【*】。【M&T Comments:请贵司确认技术标准。】 (四)我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本条款所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。 (五)互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他IMX用户的交流方式并未加密,我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。 (六)我们将定期更新并公开安全风险、个人信息安全影响评估等报告的有关内容。您可通过以下方式获得【*】。【M&T Comments:请贵司完善用户获取方式。】 (七)互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。 (八)在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您,难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。 五、您的权利【M&T Comments:请贵司补充完善相应内容，并对用户享有何种权利、具体操作流程、及用户请求的拒绝原因及依据（如有）等进行补充。】 按照新加坡相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利： （一）访问您的个人信息 您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问： 账户信息——如果您希望访问或编辑您的账户中的个人资料信息和支付信息、更改您的密码、添加安全信息或关闭您的账户等，您可以通过登陆您的个人账户执行此类操作。 搜索信息——您可以在【*】中访问或清除您的搜索历史记录、查看和修改兴趣以及管理其他数据。 ……【M&T Comments：请贵司根据自身业务进行补充完善】 如果您无法通过上述链接访问这些个人信息，您可以随时使用我们的Web表单联系，或发送电子邮件给我们，我们将在【*】日内回复您的访问请求。 对于您在使用我们的产品或服务过程中产生的其他个人信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件给我们。 （二）更正您的个人信息 当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正。您可以通过“（一）访问您的个人信息”中罗列的的方式提出更正申请。 如果您无法通过上述链接更正这些个人信息，您可以随时使用我们的Web表单联系，或发送电子邮件给我们，我们将在【*】日内回复您的更正请求。 （三）删除您的个人信息 在以下情形中，您可以向我们提出删除个人信息的请求： 1.如果我们处理个人信息的行为违反法律法规； 2.如果我们收集、使用您的个人信息，却未征得您的同意；、 3.如果我们处理个人信息的行为违反了与您的约定； 4.如果您不再使用我们的产品或服务，或您注销了账号； 5.如果我们不再为你提供产品或服务。 若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。 当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。 （四）改变您授权同意的范围 每个业务功能需要一些基本的个人信息才能得以完成（见本条款“第一部分”）。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。 您可以通过以下方式自行操作： 当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。 如果您不想接受我们给您的邮箱或者电话号码发送的商业广告，您随时可通过以下方式取消： （五）个人信息主体注销账户 您随时可注销此前注册的账户，您在账户内可自行操作。 在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求删除您的个人信息，法律法规另有规定的除外。 （六）个人信息主体获取个人信息副本 您有权获取您的个人信息副本，您可以通过以下方式自行操作： 在技术可行的前提下，例如数据接口匹配，我们还可按您的要求，直接将您的个人信息副本传输给您指定的第三方。 （七）约束信息系自动决策 在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。 （八）响应您的上述请求 为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。 我们将在30日内做出答复。 对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。 在以下情形中，按照法律法规要求，我们将无法响应您的请求： 1.与国家安全、国防安全直接相关的； 2.与公共安全、公共卫生、重大公共利益直接相关的； 3.与犯罪侦查、起诉、审判和判决执行等直接相关的； 4.有充分证据表明您存在主观恶意或滥用权利的； 5.响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的； 6.涉及商业秘密的。 六、您的个人信息如何在全球范围转移 由于我们通过遍布全球的资源和服务器提供产品或服务，这意味着，在获得您的授权同意后，您的个人信息可能会被转移到您使用产品或服务所在国家/地区的境外管辖区，或者受到来自这些管辖区的访问。 此类管辖区可能设有不同的数据保护法，甚至未设立相关法律。在此类情况下，我们会确保您的个人信息得到在新加坡共和国境内足够同等的保护。例如，我们会请求您对跨境转移个人信息的同意，或者在跨境数据转移之前实施数据去标识化等安全举措。 七、本条款如何更新 我们的隐私条款可能变更： 为提供更好的服务，我们会对本隐私条款进行合理修改。我们会在本页面上发布对本条款所做的任何变更。 对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过电子邮件发送通知，说明隐私条款的具体变更内容）。 本条款所指的重大变更包括但不限于： 1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等； 2.我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等； 3.个人信息共享、转让或公开披露的主要对象发生变化； 4.您参与个人信息处理方面的权利及其行使方式发生重大变化； 5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时； 6.个人信息安全影响评估报告表明存在高风险时。 我们还会将本条款的旧版本存档，供您查阅。 八、如何联系我们 如果您对本隐私条款有任何疑问、意见或建议，通过以下方式与我们联系： 联系方式：【*】 电子邮箱：【*】 我们设立了个人信息保护专职部门（或个人信息保护专员），您可以通过以下方式与其联系： 联系人【*】 联系方式：【*】 电子邮箱：【*】 一般情况下，我们将在【*】日内回复。
			</div>

		</div>

	</div>
</template>

<script>
	import axios from "axios";
	import { httpUrl } from "../http_url/http_url";
	import $ from "jquery";
	export default {
		data() {
			return {

			}
		}
	}
</script>

<style lang="scss">
	/*白色版本开始*/

	.notice_title_white {
		border-bottom: 2px solid #312e67 !important;
		p {
			background: #312e67 !important;
		}
	}

	.uaerContent_wrapper {
		background: #fff !important;
		border: 2px solid #eee !important;
		color: #666 !important;
		p {
			color: #333 !important;
		}
	}
	/*白色版本结束*/
	/*用户协议主要内容部分*/

	.uaerContent {
		width: 100%;
		border: 2px solid #515774;
		margin-top: 40px;
		line-height: 30px;
		box-sizing: border-box;
		padding: 0 20px;
		/*公司简介*/
		.gs-jj {
			width: 100%;
			line-height: 30px;
			font-size: 15px;
			text-indent: 2em;
			margin-top: 20px;
		}
		/*重要提示*/
		.important {
			font-size: 16px;
			line-height: 40px;
		}
		/*提示内容*/
		.ti_shi {
			width: 100%;
			font-size: 13px;
			p {
				font-size: 16px;
				margin: 40px 0 10px 0;
			}
		}
	}

	#details {
		color: #fff;
	}
	/*公告详情头部*/

	.details_content {
		width: 70%;
		margin: 20px auto;
	}
	/*内容头部*/

	.details_title {
		width: 100%;
		height: 45px;
		width: 100%;
		border-bottom: 2px solid #515774;
		border-left: 2px solid #515774;
		p {
			width: 150px;
			height: 45px;
			text-align: center;
			font-size: 16px;
			line-height: 45px;
			color: #fff;
			background: #383962;
		}
	}
</style>
